Rokasbarasa1/STM32-Quadcopter/src/main.c
/* Auto generated shit -----------------------------------------------*/
#include "main.h"
// #include "./FATFS/App/fatfs.h"

I2C_HandleTypeDef hi2c1;

SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi3;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart2;
DMA_HandleTypeDef hdma_usart2_rx;
DMA_HandleTypeDef hdma_spi3_tx;

void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_SPI1_Init(void);
static void MX_SPI3_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
/* Actual functional code -----------------------------------------------*/

#include "../lib/printf/retarget.h"
#include "stdio.h"
#include "string.h"

// Drivers
#include "../lib/mpu6050/mpu6050.h"
#include "../lib/qmc5883l/qmc5883l.h"
#include "../lib/bmp280/bmp280.h"
// #include "../lib/bme280/bme280.h"
// #include "../lib/bmp680/bmp680.h"
// #include "../lib/mpl3115a2/mpl3115a2.h"
// #include "../lib/ms5611/ms5611.h"
#include "../lib/bn357/bn357.h"
#include "../lib/nrf24l01/nrf24l01.h"
// #include "../lib/sd_card/sd_card.h"
#include "../lib/sd_card/sd_card_spi.h"
#include "../lib/betaflight_blackbox_wrapper/betaflight_blackbox_wrapper.h"

// Other imports
#include "../lib/utils/ned_coordinates/ned_coordinates.h"
#include "../lib/pid/pid.h"
#include "../lib/filtering/filtering.h"

void init_STM32_peripherals();
void calibrate_escs();
void fix_mag_axis(float *magnetometer_data);
void fix_gyro_axis(float *accelerometer_data_temp);
uint16_t setServoActivationPercent(float percent, uint16_t minValue, uint16_t maxValue);
float mapValue(float value, float input_min, float input_max, float output_min, float output_max);
void extract_request_values(char *request, uint8_t request_size, uint8_t *throttle, uint8_t *yaw, uint8_t *pitch, uint8_t *roll);
float get_sensor_fusion_altitude(float gps_altitude, float barometer_altitude);
u_int8_t init_sensors();
void init_loop_timer();
void check_calibrations();
void calibrate_gyro();
void get_initial_position();
void handle_loop_timing();

void extract_joystick_request_values_uint(char *request, uint8_t request_size, uint8_t *throttle, uint8_t *yaw, uint8_t *roll, uint8_t *pitch);
void extract_joystick_request_values_float(char *request, uint8_t request_size, float *throttle, float *yaw, float *roll, float *pitch);
void extract_request_type(char *request, uint8_t request_size, char *type_output);
void extract_pid_request_values(char *request, uint8_t request_size, float *added_proportional, float *added_integral, float *added_derivative, float *added_master);
void extract_accelerometer_offsets(char *request, uint8_t request_size, float *added_x_axis_offset, float *added_y_axis_offset);
void track_time();
float map_value(float value, float input_min, float input_max, float output_min, float output_max);
float apply_dead_zone(float value, float max_value, float min_value, float dead_zone);
void send_pid_base_info_to_remote();
void send_pid_added_info_to_remote();
char* generate_message_pid_values_nrf24(float base_proportional, float base_integral, float base_derivative, float base_master);

void handle_get_and_calculate_sensor_values();
void handle_radio_communication();
void handle_logging();
void handle_pid_and_motor_control();
void setup_logging_to_sd();
void handle_loop_end();
void handle_pre_loop_start();

// PWM pins
// PA8  - 1 TIM1
// PA11 - 4 TIM1
// PA0  - 1 TIM2
// PA1  - 2 TIM2

// UART pins
// PA2  UART2 tx GPS
// PA3  UART2 rx GPS
// PA10 UART1 rx FTDI
// PA9  UART1 tx FTDI

// I2C pins
// PB7  I2C1 SDA
// PB6  I2C1 SCL

// GPIO
// PC13 Internal LED
// PB5  SPI RADIO
// PB4  SPI RADIO
// PA12 LED

// SPI3 SD card logger
// PB5 MOSI
// PB4 MISO
// PB3 SCK
// PA15 CS
// PA12 Slave ready. Falling interrupt

// SPI1 Radio module
// PA5 SCK
// PA6 MISO
// PA7 MOSI
// PB1 CS 
// PB0 CE

/**
 * Timer peripheral clock: 75000000Hz
 * Pre scaler value: 72
 * Counter period: 19997
 * Timer clock divided by pre scaler: 1041666.6666666666Hz
 * Frequency: 52.09114700538414Hz (Actually it is like 50.08Hz)
 * Max duty cycle: 19.19712ms
 * Pwm value range: 0-19997
 * Resolution per pwm step: 0.0009600000000000001ms
 *

 * 
 * The esc is shit so we have different max and min than normal
 * 1.08ms/20ms * 4000(Counter period) = 216
 * 1.94ms/20ms * 4000 = 388
 */

const uint16_t max_esc_pwm_value = 2000;
const uint16_t actual_max_esc_pwm_value = 1917; // (max lipo amp rating / max draw of a bldc motor being used x 4) 0.917 * (max_pwm - min_pwm) + min_pwm = 371.4
const uint16_t min_esc_pwm_value = 1000;
const uint16_t esc_lowest_motor_spin = 1033;

// Sensor corrections #################################################################################

// For calibrating the magnetometer I
// used a method found in MicWro Engr Video:
// https://www.youtube.com/watch?v=MinV5V1ioWg
// Mag field norm at my location is 50.503
// use software called Magneto 1.2


// https://www.ngdc.noaa.gov/geomag/calculators/magcalc.shtml#igrfwmm
// Convert readings from this site to same units nanoTeslas to microteslas

// When calculating this remember that these values are already
// correcting and that the axis of the magnetometer are switched.

float hard_iron_correction[3] = {
    0,0,0
};

float soft_iron_correction[3][3] = {
    {1,0,0},
    {0,1,0},
    {0,0,1}
};

// float accelerometer_correction[3] = {
//     -0.043320,0.09551,1.147813
// };

// float accelerometer_correction[3] = {
//     0, 0,0
// };

float accelerometer_correction[3] = {
    0.048688, -0.011751, 1.118072
};

float accelerometer_scale_factor_correction[3][3] = {
    {0.989138,-0.0125890,0.004309},
    {-0.012589,0.997708,-0.001005},
    {0.004309,-0.001005,0.972671}
};


// X - pitch. MINUS pitch back, PLUS pitch forward.
// y - roll. MINUS roll right, PLUS roll left

// in effect PLUS y pitch backwards


// y -0.15551 leans to the right
// y -0.25551 leans to the right
// y 0.15551 leans to the back OK
// x 0.061320 y 0.15551   a bit too much forward and to the right
// x 0.051320 y 0.17551 a bit too much backwards
// x 0.056320 y 0.17551 a bit too much backwards and to the left
// x 0.063320 y 0.17551 a bit too much backwards and spinning counter clock wise a bit

// Next day
// x 0.063320 y 0.17551 a bit too much forwards
// -0.001320,0.17551,1.147813 leaning forward-left a bit
// -0.001320,0.14551,1.147813 leaning forward-mostly a bit to the left
// -0.015320,0.14551,1.147813 more stable, a bit forward and spinning clockwise
// -0.015320,0.14551,1.147813 even better but still a bit foward
// -0.019320,0.14551,1.147813 nothing changed
// -0.024320,0.14551,1.147813 not going forwards anymore but still a bit to the left
// -0.024320,0.10551,1.147813 Forwards got worse again
// -0.029320,0.10551,1.147813 best so far but see that it does go to forward left a bit
// -0.033320,0.09551,1.147813 going forward again... 

float gyro_correction[3] = {
    -2.532809, 2.282250, 0.640916
};

// handling loop timing ###################################################################################
uint32_t loop_start_time = 0;
uint32_t loop_end_time = 0;
int16_t delta_loop_time = 0;

// Accelerometer values to degrees conversion #############################################################
float accelerometer_x_rotation = 0;
float accelerometer_y_rotation = 0;
float magnetometer_z_rotation = 0;

