Rokasbarasa1/STM32-Quadcopter/src/main.c
// Radio config ########################################################################################### 
uint8_t tx_address[5] = {0xEE, 0xDD, 0xCC, 0xBB, 0xAA};
char rx_data[32];
char rx_type[32];

// PID errors ##############################################################################################
struct pid pitch_pid;
struct pid roll_pid;
struct pid yaw_pid;
struct pid altitude_pid;

float error_pitch = 0;
float error_roll = 0;
float error_yaw = 0;
float error_altitude = 0;

// Actual PID adjustment for pitch
#define BASE_PITCH_ROLL_MASTER_GAIN 0.4
#define BASE_PITCH_ROLL_GAIN_P 0.0 // 0.35
#define BASE_PITCH_ROLL_GAIN_I 0.0 // 0.0
#define BASE_PITCH_ROLL_GAIN_D 0.0 // 130.0


// Notes for PID
// 1) It is important that the natural state without power of the drone is not stable, otherwise 
// some offset of center off mass or pid desired point needs to introduced
// 2) Remember that the drone when in the air has motors spinning at idle power, just enough 
// to float in the air. If you are testing with drone constrained add a base motor speed to account for this.

// PID for yaw
const float yaw_gain_p = 0.25; 
const float yaw_gain_i = 0.0;
const float yaw_gain_d = 0.0;

// PID for yaw
const float altitude_gain_p = 0.0; 
const float altitude_gain_i = 0.0;
const float altitude_gain_d = 0.0;

// Used for smooth changes to PID while using remote control. Do not touch this

float pitch_roll_master_gain = BASE_PITCH_ROLL_MASTER_GAIN; // Dont you just love the STM#2 compiler?
float pitch_roll_gain_p = BASE_PITCH_ROLL_GAIN_P;
float pitch_roll_gain_i = BASE_PITCH_ROLL_GAIN_I;
float pitch_roll_gain_d = BASE_PITCH_ROLL_GAIN_D;

float added_pitch_roll_master_gain = 0;
float added_pitch_roll_gain_p = 0;
float added_pitch_roll_gain_i = 0;
float added_pitch_roll_gain_d = 0;

// Refresh rate ##############################################################################################

// remember that the stm32 is not as fast as the esp32 and it cannot print lines at the same speed
// const float refresh_rate_hz = 400;
#define REFRESH_RATE_HZ 200

// Sensor stuff ##############################################################################################
float complementary_ratio = 1.0 - 1.0/(1.0+(1.0/REFRESH_RATE_HZ)); // Depends on how often the loop runs. 1 second / (1 second + one loop time)
float complementary_beta = 0.005;
float filtering_alpha_accelerometer = 0.1;
float filtering_alpha_gyro = 0.01;

float acceleration_data[] = {0,0,0};
float gyro_angular[] = {0,0,0};
float gyro_degrees[] = {0,0,0};
float magnetometer_data[] = {0,0,0};
float gps_longitude = 0.0;
float gps_latitude = 0.0;
float pressure = 0.0;
float temperature = 0.0;
float altitude = 0.0;

float target_pitch = 0.0;
float target_roll = 0.0;
float target_yaw = 0.0;
float target_altitude = 0.0;

float motor_power[] = {0.0, 0.0, 0.0, 0.0};


// Remote control settings ############################################################################################
float max_yaw_attack = 20.0;

float max_pitch_attack = 10;
float pitch_attack_step = 0.2;

float max_roll_attack = 10;
float roll_attack_step = 0.2;

float throttle = 0.0;
float yaw = 50.0;
float last_yaw = 50.0;
float pitch = 50.0;
float roll = 50.0;

uint8_t shit_encoder_mode = 0;
uint8_t slowing_lock = 0;

float last_raw_yaw = 0;
float delta_yaw = 0;

float minimum_signal_timing_seconds = 0.2; // Seconds
uint32_t last_signal_timestamp = 0;


// For deciding which log file to log to
char log_file_base_name[] = "Quadcopter.txt";
char log_file_blackbox_base_name[] = "Quadcopter.BBL";
uint8_t sd_card_initialized = 0;
uint8_t log_loop_count = 0;
uint8_t sd_card_async = 0;
const uint8_t use_simple_async = 0; // 0 is the complex async
const uint8_t use_blackbox_logging = 0;


// Keep track of time in each loop. Since loop start
uint32_t startup_time = 0;
uint32_t delta_time = 0;
uint16_t time_since_startup_ms = 0;
uint8_t time_since_startup_minutes = 0;
uint8_t time_since_startup_seconds = 0;
uint8_t time_since_startup_hours = 0;


// Stuff that is needed blackbox logging 
uint32_t loop_iteration = 1;
float PID_proportional[3];
float PID_integral[3];
float PID_derivative[2];
float PID_feed_forward[3];
float PID_set_points[4];
float remote_control[4];

uint8_t entered_loop = 0;

#define GPS_OUTPUT_BUFFER_SIZE 550
#define GPS_RECEIVE_BUFFER_SIZE 550

uint8_t gps_output_buffer[GPS_OUTPUT_BUFFER_SIZE];
uint8_t receive_buffer[GPS_RECEIVE_BUFFER_SIZE];
uint8_t got_gps = 0;

// Interrupt for uart 2 data received
void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef *huart, uint16_t Size){
    // make sure the dma is initialized before uart for this to work
    // and that dma is initialized after GPIO.

    // If the stm32 is restarted  while it is initializing dma the
    // data arrives from the uart and it fucks up. So you have to restart it a few times

    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, 1);

    if (huart->Instance == USART2){   
        memcpy((uint8_t *)gps_output_buffer, receive_buffer, Size);

        // printf("\n");
        // for(uint16_t i = 0; i < GPS_RECEIVE_BUFFER_SIZE; i++){
        //     printf("%c", gps_output_buffer[i]);
        // }
        // printf("\n");

        if(entered_loop){
            if(bn357_parse_and_store((unsigned char*)gps_output_buffer, Size)){
                HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
                // printf("Working UART2, %f, %f\n", bn357_get_latitude_decimal_format(), bn357_get_longitude_decimal_format());
            }else{
                HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
                // printf("Failed UART2, %f, %f\n", bn357_get_latitude_decimal_format(), bn357_get_longitude_decimal_format());
            }
        }else{
            bn357_parse_and_store((unsigned char*)gps_output_buffer, Size);
        }

        /* start the DMA again */
        HAL_UARTEx_ReceiveToIdle_DMA(&huart2, (uint8_t *)receive_buffer, GPS_RECEIVE_BUFFER_SIZE);
        __HAL_DMA_DISABLE_IT(&hdma_usart2_rx, DMA_IT_HT);
    }
}

// Interrupt for uart 2 when it crashes to restart it
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart){
    if (huart->Instance == USART2){
        printf("Error UART 2\n");
        HAL_UART_DeInit(&huart2);
        HAL_UART_Init(&huart2);

