Rokasbarasa1/STM32-Quadcopter/src/main.c
        HAL_UARTEx_ReceiveToIdle_DMA(&huart2, receive_buffer, GPS_RECEIVE_BUFFER_SIZE);
        __HAL_DMA_DISABLE_IT(&hdma_usart2_rx, DMA_IT_HT);
    }
}

struct low_pass_filter filter_accelerometer_x;
struct low_pass_filter filter_accelerometer_y;
struct low_pass_filter filter_accelerometer_z;

struct low_pass_filter filter_gyro_x;
struct low_pass_filter filter_gyro_y;
struct low_pass_filter filter_gyro_z;

int main(void){
    init_STM32_peripherals();

    // Turn off the blue led. Will show the status of sd logging later
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
    
    printf("STARTING PROGRAM\n"); 
    // calibrate_escs();
    if(init_sensors() == 0){
        return 0; // exit if initialization failed
    }
    // check_calibrations();
    calibrate_gyro(); // Recalibrate the gyro as the temperature affects the calibration
    get_initial_position();
    setup_logging_to_sd();

    pitch_pid = pid_init(pitch_roll_master_gain * pitch_roll_gain_p, pitch_roll_master_gain * pitch_roll_gain_i, pitch_roll_master_gain * pitch_roll_gain_d, 0.0, HAL_GetTick(), 20.0, -20.0, 1);
    roll_pid = pid_init(pitch_roll_master_gain * pitch_roll_gain_p, pitch_roll_master_gain * pitch_roll_gain_i, pitch_roll_master_gain * pitch_roll_gain_d, 0.0, HAL_GetTick(), 20.0, -20.0, 1);
    yaw_pid = pid_init(yaw_gain_p, yaw_gain_i, yaw_gain_d, 0.0, HAL_GetTick(), 10.0, -10.0, 1);
    altitude_pid = pid_init(altitude_gain_p, altitude_gain_i, altitude_gain_d, 0.0, HAL_GetTick(), 0, 0, 0);

    filter_accelerometer_x = filtering_init_low_pass_filter(filtering_alpha_accelerometer);
    filter_accelerometer_y = filtering_init_low_pass_filter(filtering_alpha_accelerometer);
    filter_accelerometer_z = filtering_init_low_pass_filter(filtering_alpha_accelerometer);

    filter_gyro_x = filtering_init_low_pass_filter(filtering_alpha_gyro);
    filter_gyro_y = filtering_init_low_pass_filter(filtering_alpha_gyro);
    filter_gyro_z = filtering_init_low_pass_filter(filtering_alpha_gyro);

    handle_pre_loop_start();
    while (1){
        handle_radio_communication();
        handle_get_and_calculate_sensor_values(); // Important do do this right before the pid stuff.
        handle_pid_and_motor_control();
        handle_logging();

        handle_loop_end();
    }
}


void setup_logging_to_sd(){
    // Initialize sd card logging
    sd_card_initialize_spi(&hspi3, GPIOA, GPIO_PIN_15, GPIOA, GPIO_PIN_12);
    if(sd_test_interface()){
        printf("SD logging: Logger module is working\n");

        if(use_blackbox_logging){
            sd_card_initialized = sd_special_initialize(log_file_blackbox_base_name);
            if(sd_card_initialized){
                printf("SD logging: Initialized blackbox logging. Code %d\n", sd_get_response());
            }else{
                printf("SD logging: FAILED to initialize blackbox logging. Code %d\n", sd_get_response());
            }
        }else{
            sd_card_initialized = sd_special_initialize(log_file_base_name);
            if(sd_card_initialized){
                printf("SD logging: Initialized txt logging. Code %d\n", sd_get_response());
            }else{
                printf("SD logging: FAILED to initialize txt logging. Code %d\n", sd_get_response());
            }
        }

        if(sd_card_initialized){
            if(use_blackbox_logging){
                sd_card_async = sd_special_enter_async_byte_mode();
                printf("SD logging: entered async byte mode\n");
            }else{
                sd_card_async = sd_special_enter_async_string_mode();
                printf("SD logging: entered async string mode\n");
            }
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
            HAL_Delay(250);
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
            HAL_Delay(250);
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
            HAL_Delay(250);
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
            HAL_Delay(250);
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
            HAL_Delay(250);
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
            HAL_Delay(250);
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
            HAL_Delay(250);
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
            HAL_Delay(250);
        }else{
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
            HAL_Delay(1000);
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
            HAL_Delay(200);
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
            HAL_Delay(1000);
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
            HAL_Delay(200);
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
            HAL_Delay(1000);
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
            HAL_Delay(200);
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
            HAL_Delay(1000);
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
            HAL_Delay(200);
        }
    }else{
        printf("Failed to initialize the sd card interface\n");
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
        HAL_Delay(1000);
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
        HAL_Delay(1000);
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
        HAL_Delay(1000);
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
        HAL_Delay(1000);
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
        HAL_Delay(1000);
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
        HAL_Delay(1000);
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
        HAL_Delay(1000);
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
        HAL_Delay(1000);
    }

    if(use_blackbox_logging && sd_card_initialized){
        uint16_t betaflight_header_length = 0;
        char* betaflight_header = betaflight_blackbox_wrapper_get_header(min_esc_pwm_value, actual_max_esc_pwm_value, &betaflight_header_length);
        HAL_Delay(100); // wait a bit for it to sort its shit out
        sd_special_write_chunk_of_byte_data_no_slave_response(betaflight_header, betaflight_header_length);
        free(betaflight_header);
        HAL_Delay(500); // wait a bit for it to sort its shit out
        printf("SD logging: sent blackbox header\n");
    }
}

void handle_pre_loop_start(){
    printf("Looping\n");
    altitude = 10;

    // Capture any radio messages that were sent durring the boot proccess and discard them
    if(nrf24_data_available(1)){
        nrf24_receive(rx_data);
    }

    init_loop_timer();
    startup_time = HAL_GetTick();
    entered_loop = 1;
}

void handle_get_and_calculate_sensor_values(){
    
    // ------------------------------------------------------------------------------------------------------ Get the sensor data
    temperature = bmp280_get_temperature_celsius();
    altitude = bmp280_get_height_meters_from_reference(0);
    // altitude = get_sensor_fusion_altitude(bn357_get_altitude_meters() ,(float)bmp280_get_height_meters_from_reference(bn357_get_status_up_to_date(1)));

    
    if(bn357_get_status_up_to_date(1)){
        got_gps = 1;
        // Do some gps location pid
    }else{
        got_gps = 0;
    }

    mpu6050_get_accelerometer_readings_gravity(acceleration_data);
    mpu6050_get_gyro_readings_dps(gyro_angular);
    qmc5883l_magnetometer_readings_micro_teslas(magnetometer_data);

    // ------------------------------------------------------------------------------------------------------ Filter the sensor data
    acceleration_data[0] = low_pass_filter_read(&filter_accelerometer_x, acceleration_data[0]);
    acceleration_data[1] = low_pass_filter_read(&filter_accelerometer_y, acceleration_data[1]);
    acceleration_data[2] = low_pass_filter_read(&filter_accelerometer_z, acceleration_data[2]);

    gyro_angular[0] = low_pass_filter_read(&filter_gyro_x, gyro_angular[0]);
    gyro_angular[1] = low_pass_filter_read(&filter_gyro_y, gyro_angular[1]);
    gyro_angular[2] = low_pass_filter_read(&filter_gyro_z, gyro_angular[2]);


    // Convert the sensor data to data that is useful
    // fix_mag_axis(magnetometer_data); // Switches around the x and the y of the magnetometer to match mpu6050 outputs
    calculate_degrees_x_y(acceleration_data, &accelerometer_x_rotation, &accelerometer_y_rotation); // Get roll and pitch from the data. I call it x and y. Ranges -90 to 90. 

