Rokasbarasa1/STM32-Quadcopter/src/main.c
    // My mpu6050 has a drift problem when rotating around z axis. I have only seen Joop Broking having this problem.
    // Raw yaw - yaw without tilt adjustment
    // Yaw - yaw with tilt adjustment
    // Get raw yaw. The results of this adjustment have to modify the values of gyro degrees before complementary filter. So only the non tilt adjusted yaw is available
    calculate_yaw(magnetometer_data, &magnetometer_z_rotation);

    // if(yaw != 50){ // This is not an issue when not rotating.
    //     // Joop Brokings method did not work for me and it didn't make sense subtracting scaled total yaw. I subtract delta yaw instead
    //     delta_yaw = angle_difference(magnetometer_z_rotation, last_raw_yaw); // Helper function to handle wrapping

    //     // gyro_angular[0] -= delta_yaw * -16.5; 
    //     gyro_angular[0] -= delta_yaw * -5.0; 

    //     // This robot doesn't use the y axis so i ignore it 
    // }

    // Save the raw yaw for next loop. No mater if yaw changes or not. Need to know the latest one
    last_raw_yaw = magnetometer_z_rotation;

    // Use complementary filter to correct the gyro drift. 
    convert_angular_rotation_to_degrees_x_y(gyro_angular, gyro_degrees, accelerometer_x_rotation, accelerometer_y_rotation, HAL_GetTick(), 1);

    // Get yaw that is adjusted by x and y degrees
    calculate_yaw_tilt_compensated(magnetometer_data, &magnetometer_z_rotation, gyro_degrees[0], gyro_degrees[1]);

    // Complementary filter did not work good for magnetometer+gyro. 
    // Gyro just too slow and inaccurate for this.
    // I trust the magnetometer more than the gyro in this case.
    gyro_degrees[2] = magnetometer_z_rotation;

    fix_gyro_axis(gyro_degrees); // switch the x and y axis of gyro
}

void handle_radio_communication(){
    if(nrf24_data_available(1)){ // takes 3-4 ms
        nrf24_receive(rx_data); // takes 8-9 ms
        // Get the type of request
        extract_request_type(rx_data, strlen(rx_data), rx_type);

        if(strcmp(rx_type, "js") == 0){
            last_signal_timestamp = HAL_GetTick();

            // extract_joystick_request_values_uint(rx_data, strlen(rx_data), &throttle, &yaw, &roll, &pitch);
            extract_joystick_request_values_float(rx_data, strlen(rx_data), &throttle, &yaw, &roll, &pitch);

            // For the blackbox log
            remote_control[0] = -(roll-50); // Reversed for blackbox log
            remote_control[1] = pitch-50;
            remote_control[2] = yaw-50;
            remote_control[3] = throttle+100;

            // the controls were inversed
            pitch = (-(pitch-50))+50;

            // Throttle does not need to be handled

            // Pitch ##################################################################################################################
            // Check if pitch is neutral
            if(pitch == 50){
                // Had some issues with floats not being zero.
                // If value is between pitch attack and negative pitch attack then just set it to zero
                if(target_pitch < pitch_attack_step/2 && target_pitch > -pitch_attack_step/2){
                    target_pitch = 0.0;
                }
                // If value is above pitch attack values 
                // Start slowing going back to zero
                if(target_pitch > 0 && target_pitch != 0){
                    target_pitch = target_pitch - pitch_attack_step;
                }else if(target_pitch < 0  && target_pitch != 0){
                    target_pitch = target_pitch + pitch_attack_step;
                }
            }else if (pitch != 50){
                // If pitch is not neutral start increasing into some direction.
                if(shit_encoder_mode){
                    // Because my encoder is shit it prefers to have the extremes of pitch as 
                    // that doesn't overwhelm the pid of it.
                    if(pitch > 60){
                        target_pitch = target_pitch + pitch_attack_step;
                    }else if(pitch < 40){
                        target_pitch = target_pitch - pitch_attack_step;
                    }
                }else{
                    target_pitch = target_pitch + map_value(pitch, 0.0, 100.0, -pitch_attack_step, pitch_attack_step);
                }
            }

            // Make sure that the value is in the boundaries
            if(target_pitch > max_pitch_attack){
                target_pitch = max_pitch_attack;
            }else if(target_pitch < -max_pitch_attack){
                target_pitch = -max_pitch_attack;
            }


            // Roll ##################################################################################################################
            // Check if roll is neutral
            if(roll == 50){
                // Had some issues with floats not being zero.
                // If value is between roll attack and negative roll attack then just set it to zero
                if(target_roll < roll_attack_step/2 && target_roll > -roll_attack_step/2){
                    target_roll = 0.0;
                }
                // If value is above roll attack values 
                // Start slowing going back to zero
                if(target_roll > 0 && target_roll != 0){
                    target_roll = target_roll - roll_attack_step;
                }else if(target_roll < 0  && target_roll != 0){
                    target_roll = target_roll + roll_attack_step;
                }
            }else if (roll != 50){
                // If roll is not neutral start increasing into some direction.
                if(shit_encoder_mode){
                    // Because my encoder is shit it prefers to have the extremes of roll as 
                    // that doesn't overwhelm the pid of it.
                    if(roll > 60){
                        target_roll = target_roll + roll_attack_step;
                    }else if(pitch < 40){
                        target_roll = target_roll - roll_attack_step;
                    }
                }else{
                    target_roll = target_roll + map_value(roll, 0.0, 100.0, -roll_attack_step, roll_attack_step);
                }
            }

            // Make sure that the value is in the boundaries
            if(target_roll > max_roll_attack){
                target_roll = max_roll_attack;
            }else if(target_roll < -max_roll_attack){
                target_roll = -max_roll_attack;
            }

            // Yaw ##################################################################################################################
            if(yaw != 50){
                // There is an issue with the remote sometimes sending a 0 yaw
                // target_yaw = gyro_degrees[2] + map_value(yaw, 0.0, 100.0, -max_yaw_attack, max_yaw_attack);
                // // handle the switch from -180 to 180 degrees
                // if(target_yaw > 180.0){
                //     target_yaw = target_yaw - 360.0;
                // }else if(target_yaw < -180.0){
                //     target_yaw = target_yaw + 360.0;
                // }

                target_yaw = map_value(yaw, 0.0, 100.0, -max_yaw_attack, max_yaw_attack);
            }else{
                target_yaw = 0;
            }

