Rokasbarasa1/STM32-Quadcopter/src/main.c
            // Reset the yaw to the current degrees
            // if(last_yaw != 50 && yaw == 50){
            //     target_yaw = gyro_degrees[2];
            // }

            // last_yaw = yaw;

        }else if(strcmp(rx_type, "pid") == 0){
            printf("\nGot pid");
            
            float added_proportional = 0;
            float added_integral = 0;
            float added_derivative = 0;
            float added_master_gain = 0;

            extract_pid_request_values(rx_data, strlen(rx_data), &added_proportional, &added_integral, &added_derivative, &added_master_gain);

            pitch_roll_gain_p = BASE_PITCH_ROLL_GAIN_P + added_proportional;
            pitch_roll_gain_i = BASE_PITCH_ROLL_GAIN_I + added_integral;
            pitch_roll_gain_d = BASE_PITCH_ROLL_GAIN_D + added_derivative;
            pitch_roll_master_gain = BASE_PITCH_ROLL_MASTER_GAIN + added_master_gain;

            added_pitch_roll_gain_p = added_proportional;
            added_pitch_roll_gain_i = added_integral;
            added_pitch_roll_gain_d = added_derivative;
            added_pitch_roll_master_gain = added_master_gain;

            // Configure the pitch pid 
            pid_set_proportional_gain(&pitch_pid, pitch_roll_gain_p * pitch_roll_master_gain);
            pid_set_integral_gain(&pitch_pid, pitch_roll_gain_i * pitch_roll_master_gain);
            pid_set_derivative_gain(&pitch_pid, pitch_roll_gain_d * pitch_roll_master_gain);
            pid_reset_integral_sum(&pitch_pid);

            // Configure the roll pid 
            pid_set_proportional_gain(&roll_pid, pitch_roll_gain_p * pitch_roll_master_gain);
            pid_set_integral_gain(&roll_pid, pitch_roll_gain_i * pitch_roll_master_gain);
            pid_set_derivative_gain(&roll_pid, pitch_roll_gain_d * pitch_roll_master_gain);
            pid_reset_integral_sum(&roll_pid);

        }else if(strcmp(rx_type, "remoteSyncBase") == 0){
            printf("\nGot remoteSyncBase");
            send_pid_base_info_to_remote();
        }else if(strcmp(rx_type, "remoteSyncAdded") == 0){
            printf("\nGot remoteSyncAdded");
            send_pid_added_info_to_remote();
        }else if(strcmp(rx_type, "accel") == 0){

            float added_x_axis_offset;
            float added_y_axis_offset;

            extract_accelerometer_offsets(rx_data, strlen(rx_data), &added_x_axis_offset, &added_y_axis_offset);
            printf("\nGot accel %f %f ", added_x_axis_offset, added_y_axis_offset);

            float accelerometer_correction_new[3];
            accelerometer_correction_new[0] = accelerometer_correction[0] + added_x_axis_offset;
            accelerometer_correction_new[1] = accelerometer_correction[1] + added_y_axis_offset;
            accelerometer_correction_new[2] = accelerometer_correction[2];
            mpu6050_apply_calibration_accelerometers(accelerometer_correction_new);

            find_accelerometer_error_with_corrections(100);
            printf("\nGot accel correction %f %f ", added_x_axis_offset, added_y_axis_offset);

            mpu6050_get_accelerometer_readings_gravity(acceleration_data);

            printf("\n After correction %f %f %f", acceleration_data[0], acceleration_data[1], acceleration_data[2]);

        }

        rx_type[0] = '\0'; // Clear out the string by setting its first char to string terminator
    }
}

void handle_pid_and_motor_control(){
    // float error_altitude = mapValue(pid_get_error(&altitude_pid, altitude, HAL_GetTick()), -180.0, 180.0, -100.0, 100.0);
    // printf("Altitude error %6.2f ", error_altitude);
    
    // For the robot to do work it needs to be receiving radio signals and at the correct angles, facing up
    if(
        gyro_degrees[0] <  30 && 
        gyro_degrees[0] > -30 && 
        gyro_degrees[1] <  30 && 
        gyro_degrees[1] > -30 && 
        ((float)HAL_GetTick() - (float)last_signal_timestamp) / 1000.0 <= minimum_signal_timing_seconds
    ){
        pid_set_desired_value(&pitch_pid, target_pitch);
        pid_set_desired_value(&roll_pid, target_roll);
        pid_set_desired_value(&yaw_pid, target_yaw);

        // pid_set_desired_value(&altitude_pid, target_altitude);

        PID_set_points[0] = target_pitch;
        PID_set_points[1] = target_roll;
        PID_set_points[2] = target_yaw;

        // pitch is facing to the sides
        // roll is facing forwards and backwards
        error_pitch = pid_get_error(&pitch_pid, gyro_degrees[0], HAL_GetTick());
        PID_proportional[0] = pid_get_last_proportional_error(&pitch_pid);
        PID_integral[0] = pid_get_last_integral_error(&pitch_pid);
        PID_derivative[0] = pid_get_last_derivative_error(&pitch_pid);

        error_roll = pid_get_error(&roll_pid, gyro_degrees[1], HAL_GetTick());
        PID_proportional[1] = pid_get_last_proportional_error(&roll_pid);
        PID_integral[1] = pid_get_last_integral_error(&roll_pid);
        PID_derivative[1] = pid_get_last_derivative_error(&roll_pid);
        
        // error_yaw = pid_get_error(&yaw_pid, gyro_degrees[2], HAL_GetTick());
        error_yaw = pid_get_error(&yaw_pid, gyro_angular[2], HAL_GetTick());
        PID_proportional[2] = pid_get_last_proportional_error(&yaw_pid);
        PID_integral[2] = pid_get_last_integral_error(&yaw_pid);
        // PID_derivative[2] = pid_get_last_derivative_error(&yaw_pid);

        // error_altitude = pid_get_error(&roll_pid, altitude, HAL_GetTick());

        error_altitude = throttle*0.9;

        motor_power[0] = error_altitude + (-error_pitch) +  (-error_roll) + ( error_yaw);
        motor_power[1] = error_altitude + (-error_pitch) +  ( error_roll) + (-error_yaw);
        motor_power[2] = error_altitude + ( error_pitch) +  ( error_roll) + ( error_yaw);
        motor_power[3] = error_altitude + ( error_pitch) +  (-error_roll) + (-error_yaw);


        // Motor A (4) 13740 rpm or 229 rotations per second
        // Motor B (1) 14460 rpm or 241
        // Motor C (2) 14160 rpm or 236
        // Motor D (3) 14460 rpm or 241

